# Задача 32: Определить индексы элементов массива (списка), 
# значения которых принадлежат заданному диапазону (
# т.е. не меньше заданного минимума и не больше заданного максимума)


# Ввод: [-5, 9, 0, 3, -1, -2, 1, 4,-2,10,2,0,-9,8,10,-9, 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]

array1 = [-5, 9, 0, 3, -1, -2, 1, 4,-2, 10, 2, 0,-9, 8, 10,-9, 0, -5, -5, 7]
array = list(map(int, input(array1).split()))
idx = []
min = int(input("ВВедите мин число: "))
max = int(input("ВВедите макс число: "))
for i in range(0, len(array1)):
    if int(min) <= int(array1[i]) <= int(max):
        idx.append(i)
print(idx)

